Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Set Instance Timeline
zh_cn: 设置实例的时间轴

source: Set Instance Variable
zh_cn: 设置实例变量

source: Set Lives
zh_cn: 设置生命数

source: Set Macro Name
zh_cn: 设置宏常量名称

source: Set Macro Value
zh_cn: 设置宏常量的值

source: Set Map Value
zh_cn: 设置映射值

source: Set Master Volume
zh_cn: 设置主音量

source: Set Particle Alpha
zh_cn: 设置粒子透明度

source: Set Particle Colour
zh_cn: 设置粒子颜色

source: Set Particle Direction
zh_cn: 设置的粒子方向

source: Set Particle Gravity
zh_cn: 设置粒子的重力。

source: Set Particle Life
zh_cn: 设置粒子生命周期。

source: Set Particle Orientation
zh_cn: 设置粒子朝向。

source: Set Particle Shape
zh_cn: 设置粒子形状

source: Set Particle Size
zh_cn: 设置粒子大小

source: Set Particle Speed
zh_cn: 设置粒子速度

source: Set Particle Sprite
zh_cn: 设置粒子的精灵

source: Set Path Follow Speed
zh_cn: 设置路径跟随速度

source: Set Point Direction
zh_cn: 设置点向

source: Set Position Along Path
zh_cn: 设置路径沿线位置

source: Set Return Type
zh_cn: 设置返回类型

source: Set Score
zh_cn: 设置得分

source: Set Secondary Particles
zh_cn: 设置次级粒子

source: Set Speed
zh_cn: 设置速度

source: Set Sprite
zh_cn: 设置精灵

source: Set Text Alignment
zh_cn: 设置文本对齐

source: Set Tile At Pixel
zh_cn: 设置图块（像素）

source: Set Tile Data At Pixel
zh_cn: 设置像素位置的图块数据

source: Set Tile Data In Cell
zh_cn: 设置单元格的图块数据

source: Set Tile Data Transform
zh_cn: 设置图块数据变换

source: Set Tile In Cell
zh_cn: 网格单元为基准设置图块?

source: Set Tile Index At Pixel
zh_cn: 设置像素位置的图块索引

source: Set Tile Index In Cell
zh_cn: 设置单元格内的图块索引

source: Set Tile Set
zh_cn: 设置图块集

source: Set Timeline Moment
zh_cn: 设置时间轴的时刻

source: Set Timeline Speed
zh_cn: 设置时间轴速度

source: Set Timeline State
zh_cn: 设置时间轴状态

source: Set View Variable
zh_cn: 设置视野变量

source: Set Window State
zh_cn: 设置窗口状态

source: Set a bookmark from 0 to 9
zh_cn: 编号从0到9设置书签

source: Set a break point
zh_cn: 安插一个断点

source: Set a connection timeout value
zh_cn: 设置单次连接的超时数

source: Set a direction towards a specified point.
zh_cn: 设置指向一个特定点的方向。

source: Set a fixed direction.
zh_cn: 设置一个固定的方向。

source: Set a global variable.
zh_cn: 设置一个全局变量。

source: Set a random direction based on the specified directions.
zh_cn: 基于所指定的几个方向随机设置方向。

source: Set a value in a grid.
zh_cn: 设置栅格结构中的值。

source: Set a variable direction.
zh_cn: 设置一个可变的方向。

source: Set a variable pertaining to a room view.
zh_cn: 设置一个房间视野相关的变量。

source: Set help text
zh_cn: 设置帮助文本

source: Set number of frames
zh_cn: 设置帧数

source: Set or remove a bookmark from 0 to 9
zh_cn: 从 0 到 9 添加或者删除书签

source: Set the alpha channel (0 to 1) used for drawing.
zh_cn: 设置用于绘制的透明度通道 (0 to 1)。

source: Set the alpha channel of a particle type.
zh_cn: 设置粒子类型的 alpha 通道。

source: Set the animation speed of an instance's sprite.
zh_cn: 设置实例精灵的动画播放速度。

source: Set the color of a particle type.
zh_cn: 设置粒子类型的颜色。

source: Set the color to blend all drawing with.
zh_cn: 设置所有绘制混合的颜色。

source: Set the colour blend of an instance's sprite.
zh_cn: 设置实例精灵的混合色。

source: Set the colour of a particle type.
zh_cn: 设置一个粒子类型的颜色。

source: Set the colour to blend all drawing with.
zh_cn: 设置用于之后所有绘制所混合的颜色。

source: Set the countdown value of an alarm event.
zh_cn: 设置一个计时器事件的倒计时数。

source: Set the current moment of an instance's timeline.
zh_cn: 设置实例时间轴的当前时刻。

source: Set the deadzone of a gamepad axis.
zh_cn: 设置游戏手柄轴的死区。

source: Set the direction of a particle type.
zh_cn: 设置一个粒子类型的方向。

source: Set the displayed sprite frame
zh_cn: 设置显示的精灵帧

source: Set the font to use for all text drawing.
zh_cn: 设置用于之后所有文本绘制的字体。

source: Set the gravitational direction.
zh_cn: 设置重力方向。

source: Set the gravitational force.
zh_cn: 设置重力的大小。

source: Set the gravity of a particle type.
zh_cn: 设置一个粒子类型的重力加速度。

source: Set the health variable of the instance.
zh_cn: 设置实例中的健康值变量。

source: Set the horizontal and vertical alignment of text drawing.
zh_cn: 设置绘制文本的水平及垂直对齐方式。

source: Set the horizontal and vertical scaling of an instance's sprite.
zh_cn: 设置实例精灵的横向和纵向缩放比例。

source: Set the horizontal grid alignment.
zh_cn: 设置水平网格对齐。

source: Set the life count of the instance.
zh_cn: 设置实例中的生命数。

source: Set the life of a particle type.
zh_cn: 设置一个粒子类型的生命周期。

source: Set the major version number
zh_cn: 设置主版本号

source: Set the master volume that all other volumes are relative to.
zh_cn: 设置主音量，所有其它音频的音量与它相关。

source: Set the minor version number
zh_cn: 设置次版本号

source: Set the orientation of a particle type.
zh_cn: 设置粒子类型的粒子图片朝向。

source: Set the patch number
zh_cn: 设置补丁版本号

source: Set the pitch of a sound effect or a music track.
zh_cn: 设置音效或音轨的音调。

source: Set the playback position of a sound effect or a music track.
zh_cn: 设置音效或者音轨的播放位置。

source: Set the position of the instance along the path it is following.
zh_cn: 设置实例沿其所跟随的路径的位置。

source: Set the region of an emitter.
zh_cn: 设置一个发射器的区域。

source: Set the rotation of an instance.
zh_cn: 改变实例的旋转角度。

source: Set the score variable on the instance.
zh_cn: 设置实例的分数变量。

source: Set the shape of a particle type.
zh_cn: 设置一个粒子类型的形状。

source: Set the size of a particle type.
zh_cn: 设置粒子类型的大小。

source: Set the speed of a particle type.
zh_cn: 设置粒子类型的速度。

source: Set the speed of an instance's timeline.
zh_cn: 设置一个实例的时间轴的运行速度。

source: Set the speed of an instance.
zh_cn: 设置一个实例的运动速度。

source: Set the speed of the instance following a path.
zh_cn: 设置实例在路径上的行进的速度。

source: Set the sprite of a particle type.
zh_cn: 设置粒子类型的精灵图片。

source: Set the state of an instance's timeline.
zh_cn: 设置一个实例时间轴的状态

source: Set the threshold for the analogue buttons of the given gamepad device.
zh_cn: 设置指定游戏手柄的模拟按钮阈值。

source: Set the tile data at the specified position on a tile layer.
zh_cn: 设置在一个图块层的特定位置的图块数据。

source: Set the tile data in a cell on a tile layer.
zh_cn: 设置一个图块层中的一个单元格的图块数据。

source: Set the tile index at the specified position.
zh_cn: 设置位于指定位置的图块索引。

source: Set the tile index at the specified room position.
zh_cn: 在特定房间位置设置图块索引。

source: Set the tile index in the specified cell.
zh_cn: 设置在指定单元格处的图块索引。

source: Set the tile set resource of a tilemap.
zh_cn: 设置一个图块地图的图块集资源。

source: Set the transparency (0-1) of an instance's sprite.
zh_cn: 设置实例精灵的透明度 (0-1)。

source: Set the value of a map entry.
zh_cn: 设置映射项的值。

source: Set the value of an instance variable.
zh_cn: 设置实例变量的值。

source: Set the variable to a value for this instance only.
zh_cn: 将变量设置为仅适用于此实例的值。

source: Set the vertical grid alignment.
zh_cn: 设置垂直网格对齐。

source: Set the vertical synchronisation method (Windows Only).
zh_cn: 设置垂直同步的方法（只适用Windows）。

source: Set the volume of a sound effect or a music track.
zh_cn: 设置一个音效或音轨的音量。

source: Set the window state of the game.
zh_cn: 设置游戏窗口状态。

source: Set to enable (true) or disable (false) the application surface.
zh_cn: 设置为启用 (真)禁用 (假) 应用表面层。

source: Sets a maximum width for the game window.
zh_cn: 设置窗口的最大宽度。

source: Sets a minimum width for the game window.
zh_cn: 为游戏窗口设置最小宽度。

source: Sets the buffer method used on the Windows target platform.
zh_cn: 设置 Windows 目标平台的几何顶点缓冲区的方法。

source: Sets the caption of the window.
zh_cn: 设置窗口的标题。

source: Sets the colour of the region inside the game window but outside the visible views (default is black).
zh_cn: 设置游戏窗口内但是视野之外区域的颜色（默认黑色）。

source: Sets the position and size of the window rectangle.
zh_cn: 设置窗口矩形的位置和大小。

source: Sets the position of the mouse in the window to the indicated values.
zh_cn: 设置窗口内的鼠标位置为指定值。

source: Sets the position of the window inside the browser/visible area of the screen.
zh_cn: 设置浏览器内或者屏幕的可见区域内的窗口位置。

source: Sets the size of the window in pixels.
zh_cn: 设置窗口的大小，以像素为单位。

source: Sets the solidity of the given object.
zh_cn: 设置窗口的标题。

source: Sets the standard cursor for the game window.
zh_cn: 设置游戏窗口的普通光标。

source: Sets whether the game is run in fullscreen or not.
zh_cn: 设置游戏是否全屏运行或者窗口运行。

source: Setting
zh_cn: 设定

source: Setting Joint Values
zh_cn: 设置关节参数

source: Setting Up
zh_cn: 部署

source: Setting the values in this way will also set the draw position to the (0,0) of the display or game window, so you can provide offset values to "move" the (0,0) position:
zh_cn: 用这种方式设置的值也包括在显示器或游戏窗口中GUI绘制的位置，可以通过提供一对偏移值去“移动或改变”这个(0,0)位置。

source: Setting this option to "OK" will simply okay the change without showing the message.
zh_cn: 将该选项设置为"确定"就会不显示这条警告信息而直接进行变动。

source: Setting this option to "OK" will simply okay the deletion without showing the message.
zh_cn: 将该选项设置为“确定”就会不显示这条警告信息而直接删除。

source: Setting this option will mean that if you have the workspace zoomed and use the shortcuts to skip to another window, then the workspace will be returned to a 1:1 view and centered on the selected window.
zh_cn: 设置该选项将意味着如果你的工作区被缩放了之后又要使用快捷键跳转窗口，则工作区会自动退回到1:1的缩放视图，并且居中所选窗口。

source: Settings for {0}
zh_cn: {0}的设置

source: Setup Desktop shortcut for All Users.
zh_cn: 为所有用户安装桌面快捷方式。

source: Setup Start Menu shortcuts for All Users.
zh_cn: 为所有用户安装“开始菜单”快捷方式。

source: Setup file associations for Project Files (.yyp) and Compressed Project Files (.yyz).
zh_cn: 为项目文件（.yyp）和压缩项目文件（.yyz）设置文件关联。

source: Shader Language
zh_cn: 着色器语言

source: Shader Type
zh_cn: 着色器类型

source: Shaders
zh_cn: 着色器

source: Shaders Label Colour
zh_cn: 着色器标签颜色

source: Shaders are a very powerful tool that can be used to manipulate the graphics that your game renders to the screen, permitting incredibly fast effects that can range from, for example, adding a subtle colour hue to a sprite, right up to full screen distortion effects.
zh_cn: 着色器是一个非常强大的工具，可用于操纵渲染到屏幕上的图像，其速度之快和范围之大都令人难以置信，例如，它可以添加细微的色调给精灵，直到产生全屏失真的效果。

source: Shaders background colour
zh_cn: 着色器背景颜色

source: Shaders icon colour
zh_cn: 着色器图标颜色

source: Shape
zh_cn: 形状

source: Shape is not convex!
zh_cn: 形状不是凸多边形！

source: Share Editor
zh_cn: 分享编辑器

source: Share Overlay (128x128, 64x64, 256x128, 256x64)
zh_cn: 分享覆盖层 (Share Overlay: 128x128, 64x64, 256x128, 256x64)

source: Shift
zh_cn: 移动

source: Shift Layer Down
zh_cn: 图层下移

source: Shift Layer Up
zh_cn: 图层上移

source: Shift Path
zh_cn: 偏移路径

source: Shift Path: {0}
zh_cn: 偏移路径： {0}

source: Shockwave Flash Object
zh_cn: Shockwave Flash 对象

source: Short Description
zh_cn: 简述

source: Shortcuts
zh_cn: 快捷键

source: Should a background image be shown on workspaces
zh_cn: 是否在工作区中显示背景图片？

source: Should new toolboxes collapse if you have a floating toolbox?
zh_cn: 如果有一个浮动工具栏，新的工具栏应该折叠吗？

source: Should only contain 0-9, a-z, A-Z or _ and not start with 0-9.
zh_cn: 应只包含0-9、a-z、 A-Z或者 _，以及不要以数字0-9开始。

source: Should the overview be collapsed by default?
zh_cn: 默认情况下是否应该折叠概述？

source: Should the overview panel be collapsed by default?
zh_cn: 是否默认将该概述面板折叠?？

source: Should you need to roll back an update, you can get previous version installers by clicking the version number link on this page.
zh_cn: 如果你想回滚一次更新，你可以通过点击页面中对应版本号的链接来获取之前版本的安装包。

source: Should you need to see all instances that are currently in the room, you can select this window and they will be listed.
zh_cn: 如果你需要监视所有的当前房间中的实例，你可以选择这个窗口，它们就会被列出来。

source: Shoulder Left
zh_cn: 左肩键

source: Shoulder Right
zh_cn: 右肩键

source: Show All
zh_cn: 显示全部

source: Show Conflicts
zh_cn: 显示冲突

source: Show Debug Message
zh_cn: 显示调试信息

source: Show Dialog
zh_cn: 显示对话框

source: Show Grid
zh_cn: 显示网格

source: Show Guide
zh_cn: 显示引导

source: Show Guide Overlay
zh_cn: 显示引导层

source: Show Help...
zh_cn: 显示帮助...

source: Show In Finder
zh_cn: 在查找器中显示

source: Show Key Hash
zh_cn: 显示密钥哈希

source: Show Licence
zh_cn: 显示证可证

source: Show Line Numbers
zh_cn: 显示行数

source: Show Message
zh_cn: 显示消息

source: Show Numbers Only
zh_cn: 仅显示数字

source: Show Parent Event
zh_cn: 显示父事件

source: Show Password
zh_cn: 显示密码

source: Show Project In Finder
zh_cn: 在 查找器中显示项目

source: Show Remote Worker Installer
zh_cn: 显示远程工作者（Remote Worker）安装程序

source: Show Remote Worker Intaller
zh_cn: 显示远程工作者安装程序

source: Show Split View
zh_cn: 显示拆分视图

source: Show Tab Lines
zh_cn: 显示tab线

source: Show Text Only
zh_cn: 仅显示文本

source: Show Tile Inheritance
zh_cn: 显示图块继承

source: Show US Spelling for system functions
zh_cn: 显示系统函数的美式拼写

source: Show Views
zh_cn: 显示视野

source: Show Virtual Keyboard
zh_cn: 显示虚拟键盘

source: Show Whitespace
zh_cn: 显示空白

source: Show a message dialog when exceeding physics vertex limit
zh_cn: 超过物理顶点数量限制时显示一个消息对话框

source: Show a warning dialog on actions that can't be undone
zh_cn: 无法撤消的动作显示警告按钮

source: Show all compiler commands in the compile window during compilation.
zh_cn: 编译时在编译窗口中显示所有编译指令。

source: Show all dynamically created surfaces currently in memory.
zh_cn: 显示当前在内存中的所有动态创建的表面图层。

source: Show all textures in use by the game.
zh_cn: 显示游戏使用的所有纹理。

source: Show all verbose compiler commands.
zh_cn: 显示所有详细的编译指令。

source: Show an effect at the specified position.
zh_cn: 在特定位置显示一个特效。

source: Show background image on workspaces
zh_cn: 在工作区上显示背景图片

source: Show compiler commands in compile output
zh_cn: 在编译输出中显示编译器命令

source: Show default help comment in new events?
zh_cn: 是否默认在新的事件中显示默认帮助注释？

source: Show event icons in Debugger Resource View
zh_cn: 在调试器资源视图中显示事件图标

source: Show group node icons
zh_cn: 显示组节点图标

source: Show horizontal separators
zh_cn: 显示水平分割线

source: Show line numbers
zh_cn: 显示行号

source: Show on startup
zh_cn: 在启动时显示

source: Show only samples for my code, excluding the underlying engine code.
zh_cn: 仅显示我的代码的示例，不包括底层引擎代码。

source: Show only samples for the underlying engine code, excluding my code.
zh_cn: 仅显示底层引擎代码的示例，不包括我的代码。

source: Show package in ${explorer} on build completion
zh_cn: 构建完成时在 ${explorer} 中显示程序包

source: Show resource
zh_cn: 显示资源

source: Show room views
zh_cn: 显示房间视野

source: Show samples for my code and the underlying engine code.
zh_cn: 显示我的代码和底层引擎代码的示例。

source: Show samples in a bottom-up hierarchy, with the most detailed parts at the top of the tree.
zh_cn: 以自下而上的层次结构显示样本，最详细的部分位于树的顶部。

source: Show samples in a top-down hierarchy, with the most detailed parts at the bottom of the tree.
zh_cn: 以自上而下的层次结构显示样本，最详细的部分位于树的底部。

source: Show tab lines
zh_cn: 显示tab对齐纵线

source: Show the compile window during compilation
zh_cn: 在编译期间显示编译窗口

source: Show the compile window during compilation.
zh_cn: 编译时显示编译窗口。

source: Show tree lines
zh_cn: 显示树状线

source: Show verbose compiler output
zh_cn: 显示详细的编译器输出

source: Show welcome screen on startup
zh_cn: 在启动时显示欢迎页面

source: Show whitespace
zh_cn: 显示空白区域

source: Showing Collision Mask
zh_cn: 显示碰撞遮罩

source: Shutdown
zh_cn: 关机

source: Signature is invalid
zh_cn: 签名无效

source: Signed
zh_cn: 有符号

source: Signing Identifier
zh_cn: 签名标识符

source: Signing identities can be easily created in Xcode->Preferences->Accounts->Team->View Details->Developer ID Application->Create.
zh_cn: 签名身份很容易创建，它在 Xcode -> Preferences（首选项）->Accounts（帐户）->Team（团队）->View Details（查看详情）->Developer ID Application（开发者ID应用）->Create（创建）。

source: Signing identities can be easily created\nin Xcode->Preferences->Accounts->Team->View Details->Developer ID\nApplication->Create.
zh_cn: 在Xcode-> Preferences-> Accounts-> Team-> View Details-> Developer ID \n Application-> Create 中，可以轻松创建签名身份。

source: Signing identities can be\neasily created in Xcode->Preferences->Accounts->Team->View Details->Developer ID\nApplication->Create.
zh_cn: 签名身份很容易创建，它在\n Xcode->Preferences（首选项）->Accounts（帐户）->Team（团队）->View Details（查看详情）->Developer ID\nApplication（开发者ID应用）->Create（创建）。

source: Signing identities will be matched so the default value should be sufficient if you are only the member of one development team.
zh_cn: 仅仅是开发团队的成员，签名身份也将会匹配，默认值应该也是满足的?。

source: Signing identities will be matched so the default value\nshould be sufficient if you are only the member of one development team.
zh_cn: 如果您是开发团队唯一的成员，那么签名身份也会匹配，因此默认值应该足够。

source: Simple Binary Arithmetic
zh_cn: 简单二进制算术运算

source: Simple.
zh_cn: 简单。

source: Simply scroll along to the end of the given path, add a space, then the parameter string.
zh_cn: 光标移动到文本末尾，添加一个空格，然后添加命令行参数字符串。

source: Simulator
zh_cn: 模拟器

source: Simulator - iPad 2
zh_cn: 模拟器 - iPad 2

source: Simulator - iPad Air
zh_cn: 模拟器 - iPad Air

source: Simulator - iPad Air 2
zh_cn: 模拟器 - iPad Air 2

source: Simulator - iPad Pro
zh_cn: 模拟器 - iPad Pro

source: Simulator - iPad Retina
zh_cn: 模拟器 - iPad Retina

source: Simulator - iPhone 4S
zh_cn: 模拟器 - iPhone 4S

source: Simulator - iPhone 5
zh_cn: 模拟器 - iPhone 5

source: Simulator - iPhone 5S
zh_cn: 模拟器 - iPhone 5S

source: Simulator - iPhone 6
zh_cn: 模拟器 - iPhone 6

source: Simulator - iPhone 6 Plus
zh_cn: 模拟器 - iPhone 6 Plus

source: Since 16 frames is a power of 2 number, and since 0 is included in the counter, we can reduce the POW2 number by 1 and use it as a MASK, and using that we can use it to wrap our counter.
zh_cn: 因为 16 帧是 2 的平方数，并且计数器中包含 0，所以我们可以将 2 的次方数减 1 作为掩码使用，这样我们就可以用它来包装计数器。

source: Since arrays are numbered consecutively, this means you can loop through them to perform extra actions too, like we did to initialize it:
zh_cn: 另外因为数组的数据是连续的，所以我们可以使用循环来调用数组，就如同数组的初始化：

source: Since docks can be re-arranged and the contents can be removed as stand-alone windows or even closed entirely, this window permits you to re-open them if you find that you need them for anything.
zh_cn: 由于停靠栏可以被重新安置且其内容可以被移除为一个独立窗口甚至可以彻底关闭，该窗口允许你在你发现你还需要它们的时候重新打开它们。

source: Since this can be quite a complex concept to grasp and then apply to real-world programming situations, you can find below a series of short examples that could be applied to any game made with GameMaker Studio 2.
zh_cn: 由于这是一个相当复杂且需要掌握的概念，你应该学会应用到实际的编程环境中，你可以在下面找到一些简短的例子，这些例子可以应用到任何使用 GameMaker Studio 2 制作的游戏中。

source: Since this is essentially a mini-tutorial to get you started, we've split it into sections which you can get to from the following links:
zh_cn: 由于这是引导你入门的迷你教程，我们已经将它分割成如下几个小节：

source: Single Colour
zh_cn: 单色模式

source: Single colour simply sets the background to the colour of your choice (using the Colour 1 setting, as explained below) while block pattern is the default setting (which can also be edited using the rest of the dialogue options shown below).
zh_cn: 单色模式会单纯地把背景设置为你所选的颜色（使用颜色 1（Colour 1）设定，下文会提到），而默认选项是方块图案（它还可以通过下文所示的其余对话框选项进行修改）。

source: Single pane
zh_cn: 单一窗格

source: Sit back, relax, and let us introduce you to some of our cool {0}'New Features'{1}
zh_cn: 坐下来，放松一下，让我们向您介绍一些很酷的{0}'新功能'{1}

source: Size
zh_cn: 大小

source: Size of Points
zh_cn: 点大小

source: Size of text
zh_cn: 字体大小

source: Size:
zh_cn: 尺寸：

source: Size: {0}
zh_cn: 大小: {0}

source: Size: {0} x {1}
zh_cn: 尺寸：{0} x {1}

source: Skip the cursor to the end of the script or event
zh_cn: 将光标跳转至脚本或事件的结束位置

source: Skip the cursor to the start of the script or event
zh_cn: 将光标跳转至脚本或事件的起始位置

source: Skipped action {0} as it applies to <undefined>
zh_cn: 跳过动作{0}，因为它适用于<undefined>

source: Skipped action(s) {0} because parent 'if' action was skipped
zh_cn: 跳过动作{0}，因为跳过了父级的 'if' 动作(?)

source: Skipping pixels.
zh_cn: 略过一些像素。

source: Sleep Margin in ms
zh_cn: 睡眠延迟（毫秒）

source: Sleep Margin in ms (default 10ms)
zh_cn: 睡眠延迟（默认10毫秒）

source: Sleep Margin in ms (default 4ms)
zh_cn: 睡眠延迟 （默认4毫秒）

source: Sleep margin (ms)
zh_cn: 睡眠余量 (ms)

source: Sleep margin (ms) - default 10ms
zh_cn: 睡眠余量 (ms) - 默认 10ms

source: Sleep margin (ms) - default 4ms
zh_cn: 睡眠余量 (ms) - 默认 4ms

source: Slider
zh_cn: 滑块

source: Slow double-click time (ms)
zh_cn: 双击延迟时间 (毫秒)

source: Slow double-click time in milliseconds
zh_cn: 延缓双击时间（毫秒）

source: Small
zh_cn: 小

source: Small Cycle Image
zh_cn: 小的循环图片

source: Small Front Flip Image
zh_cn: 向前翻转的小型图片

source: Small Iconic
zh_cn: 小图标型

source: Small Image
zh_cn: 小图

source: Small Logo
zh_cn: 小Logo

source: Smoke
zh_cn: 烟雾

source: Smoke Up
zh_cn: 上升烟雾

source: Smooth
zh_cn: 平滑

source: Smooth Curve
zh_cn: 平滑曲线

source: Snap
zh_cn: 对齐

source: Snap Path To Grid
zh_cn: 将路径吸附到网格

source: Snap Position
zh_cn: 吸附位置

source: Snap To Grid (${toggle_grid_snap})
zh_cn: 对齐网格 (${toggle_grid_snap})

source: Snap To Grid (CTRL+G)
zh_cn: 网格对齐 (CTRL+G)

source: Snap X
zh_cn: 对齐 X

source: Snap X:
zh_cn: 吸附 X:

source: Snap Y
zh_cn: 对齐 Y

source: Snap Y:
zh_cn: 吸附 Y:

source: Snap an instance's position to a grid.
zh_cn: 将实例的位置吸附到网格上。

source: Snap to Grid
zh_cn: 对齐到网格

source: Snap to grid
zh_cn: 对齐网格

source: Snap:
zh_cn: 吸附：

source: Snow
zh_cn: 雪

source: So - OR (|), AND(&), NOT(~) and EOR(^) let us manipulate bits with relative ease, allowing us, at the simplest level, to control multiple bits at once.
zh_cn: 所以 - 或 (|)、 与(&)、 非(~) 以及异或(^) 让我们可以相对容易的操作位运算，允许我们在一个最简单的层面上一次性同时控制多个位。

source: So actually not that complex really.
zh_cn: 所以其实没有那么复杂，真的。

source: So adding a 1+1 means we overflow into 10.
zh_cn: 所以 1 + 1 意味着溢出到 10。

source: So bit 2 = 2, bit 3 = 4, bit 4 = 8 and so on (as shown below in this byte table - a byte being a collection of 8 bits):
zh_cn: 所以 2 号位 = 2，3 号位 = 4，4 号位 = 8 等等（如下所示，在这个 字节表中 - 一个字节是 8 位的集合）：

source: So even if bit 1 was already set, the operation still works and bit 3 will now also be set.
zh_cn: 所以，当 1 号位已经被设置的时候，该操作对 3 号位依然有效并且也会同样被设置.

source: So for only 2xAA, this will report 2, for 2x and 4x availability it will report 6.
zh_cn: 所以只支持 2xAA（2倍的AA）会输出2，对于 2x 和 4x（2倍或4倍） 的可用性将输出6。

source: So here we go:
zh_cn: 那么我们这样做：

source: So how about 16, or 128?
zh_cn: 那么 16 倍或 128 倍呢？

source: So if had a value of 1000111011 and I wanted to clear bits 1 and 3 using the mask above, I would end up with this...
zh_cn: 再比如我们有一个值 “1000111011”，我们想要清理位 1 和位 3，使用上面的掩码，我将用这个结束这个操作：

source: So if we had the number 51 (110011) what does this do?
zh_cn: 如果参数 0 为 51(110011)，这条语句的作用是什么？

source: So if you can pack all yours flags down into a single memory access, this is good!
zh_cn: 所以如果你能把你所有的标记都打包成单一的内存通道，那是极好的！

source: So if you click this on the default view, for example, then an exact copy will be made for you to then edit.
zh_cn: 因此，如果您在默认视图中单击此选项，那么它将会为您准备一个精确复制的副本，然后基于此进行编辑。

source: So let's look at a more complex example.
zh_cn: 让我们来看一个更复杂的例子。

source: So let's look at the most basic binary theory first - how numbers are created.
zh_cn: 所以，我们先看一下最基础的二进制理论 - 数字是怎样创建的。

source: So let's say Bit 27 is an active flag, and bit 0 is an exploding flag.
zh_cn: 那么假设 27 号位是一个激活标志，0 号位是一个爆炸标志。

source: So the above should be written as either this:
zh_cn: 所以，上面的应该这样写：

source: So there you go….
zh_cn: 这样做下去……

source: So there you shift the single bit down by 5 (which is the number of shifts required for 32 – look above), which gives us 2.
zh_cn: 所以，这里你应该向 低阶 移动 5 位（这也是要得到 32 时需要移动的位数——见上文），最终我们会得到 2。

source: So they'll do each calculation in blocks of 2.
zh_cn: 所以它们将分两次进行分别计算。

source: So this happily lets us set and clear any bits we'd like, and it also lets us compress out data structures massively.
zh_cn: 所以，这让我们很方便地设置并清空我们需要的任意位，并且它也可以让我们很大幅度地压缩数据结构。

source: So to avoid any issues you are best not to call multiple functions in the arguments of a function call as you may well be building in a reliance on the order of evaluation.
zh_cn: 因此为了避免可能发生的任何问题，你最好不要在参数里调用大量的函数。So to avoid any issues you are best not to call multiple functions in the arguments of a function call as you may well be building in a reliance on the order of evaluation.

source: So use this functionality with care!
zh_cn: 所以请谨慎使用此功能 ！

source: So we click on the from down menu for setting the origin and select "middle centre": You'll see the origin cross-hair in the preview image move to the centre of the sprite.
zh_cn: 所以我们点击 从下拉菜单来设置原点并选择“中间中心”： 你会看到预览图像中的原点十字线移动到精灵的中心。

source: So what exactly does the binary OR operator do?
zh_cn: 所以二进制“或”运算符究竟是做什么的呢？

source: So what if you wanted a key to open 2 or 3 doors?
zh_cn: 如果你想要一把钥匙打开 2 到 3 扇门呢？

source: So when we talk about something affecting or changing an instance, we mean that one particular copy of an object in a room is being affected while all the rest are not, but when we talk about affecting or changing an object we mean that anything we do to it will be reflected in all the instances created from that point on too.
zh_cn: 所以当我们谈论影响或改变一个 实例 时，我们的意思是某个房间中某个物体的一个特定副本受到影响，而其余的则不受影响，但是当我们谈论影响或改变一个 物体 时，我们的意思是我们所做的所有事情也将反映在物体所衍生的所有实例中。
